LTR = '‎'

RTL = '‏‏'

LANGUAGE = 'زبان'

USER = 'کاربر'

SELECT_LANGUAGE = 'لطفا زبان خود را انتخاب کنید:'

NEW_INVITATION_NOTIF = '👥 کاربر {} با لینک اختصاصی شما وارد ربات شد.\n' \
                       '/notification :تنظیمات اعلان'

START_AGAIN = 'نیازی به شروع مجدد نیست.\n' \
              'در صورت نیاز راهنمای ربات /help را مطالعه کنید.'

UNKNOWN_CANCEL = 'عملیات با موفقیت لغو شد.'

CANCEL_INVALID = 'چیزی برای انصراف وجود ندارد!'

TIPS_HEADER = '💎 به کمک این ربات، شما می‌توانید عکس‌، فیلم و گیف‌های خود را ' \
              ' به راحت‌ترین شکل ممکن واترمارک کنید.\n\n'

START_TIPS = '✔️ <b><u>📜 نکات‌آموزشی</u></b>:\n\n' \
             '▪️ با ورود به بخش [🔧 مدیریت لوگوها] می‌توانید تا چهار لوگو مختلف ایجاد کرده و  تنظیمات آن‌ها را به دلخواه' \
             ' شخصی‌سازی کنید. \n\n' \
             '▪️ زمانی که فایلی را (عکس، فیلم و گیف) به ربات ارسال یا فوروارد می‌کنید' \
             ' ربات همان فایل را به همراه دکمه‌های شیشه‌ای به شما ارسال می‌کند' \
             ' و شما به کمک آن دکمه‌های شیشه‌ای می‌توانید آن فایل را واترمارک کنید.\n\n' \
             '▪️ اگر می‌خواهید بلافاصله پس از ارسال عکس به ربات، آن عکس به صورت خودکار واترمارک شود ' \
             'کافی است وارد [⚙️ تنظیمات] شده و تنظیمات خودکارسازی واترمارک را به دلخواه انجام دهید.\n\n' \
             '▪️ شما میتوانید روزانه تا ۳ عکس را به صورت رایگان واترمارک کنید' \
             ' اما در صورت نیاز به واترمارک ویدیو، گیف و عکس‌های بیشتر می‌توانید' \
             'اشتراک پرمیوم ربات را تهیه کنید.\n\n' \
             '▪️ قبل از اقدام به خرید اشتراک پرمیوم، می‌توانید از مدت سه روزه اشتراک پرمیوم رایگان استفاده کرده' \
             ' و از عملکرد ربات اطمینان حاصل کنید، این هدیه' \
             ' شامل 20 مگابایت حجم برای واترمارک فیلم است.\n\n' \
             '▪️ در صورتی که اشتراک پرمیوم ربات را خریداری کرده باشید می‌توانید بی‌شمار عکس واترمارک کنید و تا پایان ' \
             'یافتن حجم واترمارک، فیلم و گیف‌های خود را نیز واترمارک کنید.\n\n' \
             '▪️ در هر بار واترمارک ویدیو یا گیف، به اندازه حجم آن فایل از حجم بسته واترمارک شما کاسته می‌شود،' \
             ' اما واترمارک عکس از این قاعده پیروی نمی‌کند و حتی در صورت اتمام حجم بسته واترمارک، تا زمانی‌که' \
             'اعتبار زمانی اشتراک پرمیوم شما پایان نرسیده است می‌توانید عکس‌های خود را واترمارک کنید. .\n\n' \
             '▫️ در صورته مواجهه به مشکل ' \
             'با پستیبان @WMarkProBotSupport تماس بگیرید.'

START_DEAR = 'عزیز'

START_WELCOME = 'به ربات <b>واترمارک 🤖</b> خوش آمدید.'

TUT_HEADER = '📜 از کجا شروع کنیم؟'

TUT1 = '۱- ابتدا دکمه [🔧 مدیریت لوگوها] را بزنید و لوگو جدیدی ایحاد کنید و تنظیمات آن را به دلخواه خود شخصی‌سازی کنید.'

TUT2 = '۲- حال کافی است عکس، فیلم یا گیفی را که می‌خواهید' \
       ' واترمارک شود را به ربات ارسال یا فوروارد کنید و منتظر پاسخ ربات باشید و با دکمه های شیشه ای که ربات در ' \
       'اختیار شما قرار می‌دهد واترمارک را انجام دهید.'

TUT3 = '۳- در صورتی که می‌خواهید بلافاصله پس ازارسال عکس به ربات، عکس ارسالی به صورت خودکار واترمارک شود، وارد ' \
       '[⚙️ تنظیمات] شده و مطابق دلخواه خود تنظیمات خودکارسازی را انجام دهید.'

LANGUAGE_SET = '✅ زبان شما به {} تغییر کرد.'

QUIT_ERROR = '✖️ بیش از ۴۸ ساعت از ایجاد این پیام میگذرد و دیگر امکان حذف آن وجود ندارد. 🙄\n\n' \
             'لطفا خودتان آن را حذف کرده یا آن را رها کنید.'

QUIT = '👌✖️'

LIMIT_REPLY_CHARACTER = '⚠️ تعداد حروف مجاز، {max_length} حرف است، درحالی که شما {user_length} حرف وارد کرده‌اید!'

SHORTEN_YOUR_TEXT = 'لطفا متن خود را کوتاه کرده و مجددا ارسال کنید:'

CANCEL = '/Cancel :انصراف ✘'

CORRECT_COMMENT = 'لطفا متن خود را اصلاح کرده و مجددا ارسال کنید:'

PARAGRAPH_FORMAT = '⚠️ متن را در قالب یک خط ارسال کنید و از خط جدید استفاده نکنید!'

SELECT_LOGO_POSITION = '👈 لطفا مکان لوگو را مشخص کنید:'

LOGO_SETTING = '🔧 <b>ایجاد و مدیریت لوگوها</b>:\n\n' \
               '🔻 شما می‌توانید تا ۴ لوگو مختلف ایجاد کرده و آن‌ها را مدیریت کنید.\n' \
               '🔻 برای افزودن لوگو جدید دکمه [➕ لوگو جدید] را بزنید.\n' \
               '🔻 برای شخصی‌سازی تنظیمات هر یک از لوگوها، دکمه آن لوگو را انتخاب کنید.'

SEND_LOGO = '🖼 شما به چندین روش می‌توانید لوگوی موردنظر خود را ایجاد کنید:\n\n' \
            ' ۱- متن لوگوی موردنظر خود (برای مثال @RobomizBot) را به ربات ارسال کنید' \
            ' در این صورت ربات به صورت پیش‌فرض لوگویی با نماد تلگرام ' \
            ' برای شما ایجاد می‌کند و با ابزارهایی که در اختیار شما قرار می‌دهد ' \
            'می‌توانید آن لوگو را شخصی‌سازی کنید.\n\n' \
            '۲- به کمک نرم‌افزارهای ویرایش عکس (فوتوشاپ، پیکس‌آرت و ...) لوگوی اختصاصی و بدون پس‌زمینه ' \
            'با فرمت PNG ایجاد کنید و آن را به صورت (Send as file) به ربات ارسال کنید.\n\n' \
            '۳- در صورتی که تصویر لوگوی شما حاوی پس زمینه مشکی یا سفید است و میخواهید پس زمینه سفید یا مشکی ' \
            'آن را حذف کنید فایل لوگو را به صورت (Send as photo) به ربات ارسال کنید، در این صورت ربات گزینه' \
            'حذف پس‌زمینه مشکی یا سفید را در اختیار شما قرار می‌دهد.\n\n' \
            '۴- شما حتی می‌توانید استیکر‌های ثابت تلگرام را به عنوان لوگو به ربات ارسال کنید.\n\n' \
            '🔻 نکته: می‌توانید نام لوگو را در زیرنویس فایل ارسالی درج کنید.\n\n' \
            '👈 <b>لطفا با توجه به توضیحات بالا متن یا فایل خود را ارسال کنید:</b>'

LOGO_SPEC = '<b> 🔖 مشخصات لوگو:</b>'

LOGO_TEXT = '✏️ متن لوگو: {}'

LOGO_NAME = '✏️ نام لوگو: {}'

LOGO_OPACITY = '💧 درجه وضوح لوگو: {}'

LOGO_RATIO = '🔳 نسبت عرض لوگو▪️ به عرض تصویر⬜️: {}'

LEFT_RIGHT = '↔ حاشه چپ و راست: {}'

UP_DOWN = '↕ حاشیه بالا و پایین: {}'

CHANGE_LOGO_SPEC = '👈 برای تغییر هر کدام از مشخصه‌ها دکمه مربوط به آن را انتخاب کنید.'

SUBMIT_TEXT_LOGO = '👈 لطفا متن لوگو را در قالب یک سطر با طول حداکثر ۵۰ حرف (کاراکتر) ارسال کنید:'

SUBMIT_NAME_LOGO = '👈 لطفا برای لوگوی خود نامی در قالب یک سطر با طول حداکثر ۲۰ حرف (کاراکتر) ارسال کنید:'

NEW_LOGO_CREATED = '✔️ لوگو جدید ساخته شد.'

SUBMIT_LOGO_COLOR = '🎨 لطفا رنگی برای نماد انتخاب کنید:'

SUBMIT_TEXT_COLOR = '🎨 لطفا رنگی برای متن انتخاب کنید:'

SUBMIT_OPACITY = '💧 لطفا درجه وضوح لوگو نسبت به تصویر را به درصد مشخص کنید:\n\n' \
                 'نکته: هرچه این مقدار بیشتر باشد لوگو واضح‌تر نمایش داده می‌شود و با کم کردن این مقدار لوگو محوتر خواهد شد.'

SUBMIT_RATIO = '🔳 لطفا نسبت اندازه عرض لوگو به عرض تصویر را از بین گزینه‌های موجود انتخاب کنید:\n' \
               '🔻 همچنین می‌توانید عددی در بازه (100, 0) را به دلخواه تایپ و ارسال کنید!'

ONLY_PHOTO = '👈 شما در مرحله ارسال لوگو قرار دارید.\n' \
             'لطفا لوگوی خود را ارسال کنید:'

LOGO_ACCEPTED = '✔️ لوگو دریافت شد.'

ONLY_RATIO = '👈 شما در مرحله وارد کردن نسبت اندازه لوگو به اندازه تصویر هستید.\n' \
             'لطفا عددی بین 0 تا 100 وارد کنید:'

SET_NEW_RATIO = '✔️ نسبت اندازه‌ها به {}٪ تغییر یافت..'

SET_NEW_LOGO_NAME= '✔️ نام لوگو ثبت شد.'

INSERT_MARGIN = '👈 به منظور افزایش دقت در مکان قرارگیری لوگو شما می‌توانید' \
                ' تعیین کنید که فاصله لوگو نسبت به لبه‌های کناری عکس چه اندازه باشد.\n' \
                'برای تنظیم هر کدام از این فاصله‌ها، دکمه مربوط به آن را انتخاب کنید:'

INSERT_MARGIN_W = '👈 در این مرحله شما می‌توانید تعیین کنید که فاصله لوگو از لبه‌های چپ یا راست تصویر (بسته به مکان قرارگیری لوگو) چه درصدی از عرض تصویر باشد.\n' \
                'در صورتی که می‌خواهید لوگو به دیواره کناری چسبیده باشد عدد صفر و در غیر این صورت مقدار بزرگتری را انتخاب کنید:'

INSERT_MARGIN_H = '👈 در این مرحله شما می‌توانید تعیین کنید که فاصله لوگو از لبه‌های پایین یا بالای تصویر (بسته به مکان قرارگیری لوگو) چه درصدی از ارتفاع تصویر باشد.\n' \
                'در صورتی که می‌خواهید لوگو به دیواره پایین یا بالا چسبیده باشد عدد صفر و در غیر این صورت مقدار بزرگتری را انتخاب کنید:'

SET_FONT = '🎨 لطفا نوع قلم (فونت) متن را انتخاب کنید:'

REMOVE_LOGO = 'آیا از حذف لوگو مطمئنید؟'

SELECT_LOGOTYPE = '👈 لطفا از بین طرح‌های موجود یکی را انتخاب کنید:'

LOGO_REMOVED = 'لوگو از روی عکس برداشته شد!'

LOGO_REMOVED_TEMP = 'لوگو موقتا از روی فیلم برداشته شد!\n\n' \
               'برای اعمال تغییرات، دکمه {ثبت نهایی} را بزنید.'

NO_LOGO_YET = '🔻 شما هنوز لوگویی ثبت نکرده‌اید برای افزودن لوگو، دکمه [🔧 مدیریت لوگو‌ها] را بزنید.'

JUST_PRO_WATERMARK = '⚠️ تنها مشترکین پرمیوم می‌توانند لوگوی خود را بر روی عکس‌های ارسالی درج کنند.'

SUBMIT_STROKE_COLOR = '🎨 لطفا رنگی برای سایه متن انتخاب کنید:'

AUTO_RATIO = '✅ نسبت اندازه‌ها در حالت خودکار قرار گرفت!\n' \
             'در حالت خودکار با توجه به اندازه لوگو و عکس، در هنگام واترمارک نسبت اندازه محاسبه خواهد شد.'
AUTO_STAT = 'حالت خودکار'

WHITE_TO_TRANSPARENT = '✅ پس زمینه سفید با موفقیت حذف شد.'

BLACK_TO_TRANSPARENT = '✅ پس زمینه سیاه با موفقیت حذف شد.'

LOGO_TEST_WATERMARKED = '✅ واترمارک با موفقیت انجام شد.'

LOGO_WATERMARKED = '✅ واترمارک انجام شد.'

LOGO_WATERMARKED_TEMP = '✅ واترمارک موقت انجام شد.\n\n' \
                        '👈 برای اعمال تغییرات، دکمه [تایید نهایی] را بزنید. '

ONLY_TEXT = '⚠️ لطفا پیام متنی ارسال کنید:'

SPAM_LIMIT = '⚠️ به منظور مقابله با حملات ربات‌ها و جلوگیری از کاهش سرعت ربات، محدودیت ارسال ۲۰ پیام ' \
               'در دقیقه برای تمامی کاربران لحاظ شده است!'

PER_DAY_LIMIT = '⚠️ در اشتراک رایگان، شما در هر روز حداکثر می‌توانید سه عکس را واترمارک کنید.\n' \
                'برای رفع این محدودیت، اشتراک پرمیوم ربات را خریداری کنید.\n' \
                '/upgrade'

FREE_LIMIT = '⚠️ در اشتراک رایگان، شما مجاز به واترمارک ویدیو و گیف نیستید.\n' \
                'برای رفع این محدودیت، اشتراک پرمیوم ربات را خریداری کنید.\n' \
                '/upgrade'

BE_PATIENT = 'لطفا شکیبا باشید. 🙏'

WATERMARK_ALLOWED = 'لطفا پیامی از نوع عکس، فیلم و یا گیف ارسال کنید:'

LOW_WATERMARK_VOLUME = '⚠️ حجم بسته واترمارک شما کمتر از سایز این فیلم است!\n' \
                       'برای دریافت حجم، دکمه [💎 دریافت اشتراک] را بزنید.'

JUST_PRO_WATERMARK_VIDEO = '⚠️ واترمارک ویدیو مخصوص کاربران با اشتراک ویژه است.\n' \
                           'برای دریافت اشتراک، دکمه [💎 دریافت اشتراک] را بزنید.'

LIMITED_WATERMARK_SIZE = '⚠️ در حال حاضر حداکثر سایز فیلم قابل واترمارک، ۲۰ مگابایت است!\n\n' \
                         'این محدودیت با ارتقا سرور کاهش خواهد یافت.'

WATERMARK_PRO_VOLUME = 'باقیمانده حجم واترمارک'

PRO_SUBSCRIPTION = 'تاریخ اعتبار اشتراک پرمیوم'

ACTIVE_TILL = 'فعال تا'

DEACTIVE_FROM = 'غیرفعال از'

DEACTIVE = 'غیرفعال'

NO_LANGUAGE = 'نامشخص'

SETTINGS = 'تنظیمات'

SELECT_LOGOS = '👈 در صورتی که می‌خواهید عکس‌های ارسالی به ربات، بلافاصله و به صورت خودکار واترمارک شوند ' \
               'کافی است از بین لوگوهای زیر لوگو و مکان پیش‌فرض آن را مشخص کنید.'

NO_LOGOS = '⚠️ شما هنوز لوگویی را به ثبت نرسانده‌اید.\n' \
                ' 👈 از قسمت [مدیریت لوگوها]، لوگوی خود را ثبت کرده و مجددا تلاش کنید.'

AUTO_LOGO_DEACTIVATED = '☑️ چسباندن خودکار این لوگو غیرفعال شد.'

AUTO_LOGO_ACTIVATED = '✅ چسباندن خودکار این لوگو فعال شد!'

VIP_INSERTED = '#تمدید_اشتراک\n' \
               'User: {} #u{}\n' \
               'Days: {}\n' \
               'Old date: {},  new date: {}\n' \
               'Volume: {}\n' \
               'Old volume: {} MB, new volume: {} MB'

PROMOTE_BY_ADMIN_HEADER = 'کاربر گرامی، {} عزیز:\n\n'

TIME_PROMOTION = '✅ اشتراک پرمیوم شما، تا تاریخ {} تمدید شد. \n\n'

VOL_INCREASE = '✅ حجم واترمارک شما، تا {}MB افزایش یافت. \n\n'

PROMOTE_BY_ADMIN_FOOTER = 'با تشکر از اعتماد و همراهی شما 🙏😊'

VIP_INSERT_PROBLEM = 'فردی با این آیدی عضو ربات نیست!!'

VIP_INSERT_GUIDE = 'لطفا مطابق الگوی زیر دستور را ارسال کنید:' \
                   '\n/promote user_id days volume(in MB)' \
                   '\nمثال:' \
                   '\n/insert 123457834 31 200'

END_OF_PROMOTION = 'کاربر گرامی، {} عزیز:\n\n' \
            '⚠️ اعتبار اشتراک پرمیوم شما، هم اکنون به اتمام رسیده‌است.\n' \
            '👈 جهت تمدید اشتراک خود، کافی است دستور /upgrade را زده نسبت به تمدید اشتراک خود اقدام نمایید.\n\n' \
            'با تشکر 🙏😊'

SUBMIT_ICON_SIZE = '🎨 لطفا سایز نماد را انتخاب کنید:'

CURRENT_SUBSCRIPTION = 'اشتراک فعلی شما: {}'

FREE = 'رایگان'

PREMIUM = 'پرمیوم'

PREMIUM_NOTICE = '🔶 نکات مهم قبل از خرید اشتراک پرمیوم'

PREMIUM_UNLIMITED_PHOTO = '🔸 با خرید اشتراک پرمیوم، شما می‌توانید بیشمار عکس را تا زمانی که' \
                          ' اعتبار اشتراک به پایان نرسیده است واترمارک کنید.'

PREMIUM_VIDEO_SIZE_LIMIT = '🔸 در حال حاضر با داشتن اشتراک پرمیوم می‌توانید فیلمی‌هاو گیف‌هایی ' \
                           'با حداکثر حجم 20MB را واترمارک کنید.' \
                           ' (این محدودیت با گذشت زمان و ارتقا سرور کاهش خواهد یافت.)'

PREMIUM_FREE = '🔸 در پلن رایگان می‌توانید روزانه تا سه عکس را به صورت رایگان واترمارک کنید.'

PREMIUM_FREE_TRIAL = '🔸 قبل از اقدام به خرید اشتراک پرمیوم، می‌توانید از مدت سه روزه اشتراک پرمیوم رایگان استفاده ' \
                     'کرده و از عملکرد ربات اطمینان حاصل کنید.'

PREMIUM_VOLUME = '🔸 پس از پایان یافتن اشتراک پرمیوم حجم باقمیانده واترمارک از بین نخواهد رفت و ' \
                 'پس از تمدید اشتراک به حجم خریداری شده افزوده خواهد شد.'

PREMIUM_WATERMARK_VOLUME = '🔸 در هر زمانی شما می‌توانید اشتراک خود را تمدید کنید یا بسته حجمی واترماک خریداری کنید. ' \
                           'در این صورت اعتبار خریداری شده به اعتبار قعلی شما افزوده خواهد شد.'

PREMIUM_PLANS = '📜 پلن‌های موجود:'

PREMIUM_ONE = '📦 اشتراک یک ماهه + 200MB حجم واترمارک ---» ($ 4.99)'

PREMIUM_TREE = '📦 اشتراک سه ماهه + 600MB حجم واترمارک ---» ($ 11.99)'

PREMIUM_SIX = '📦 اشتراک شش ماهه + 1200MB حجم واترمارک ---» ($ 17.99)'

PREMIUM_TWELVE = '📦 اشتراک یک ساله + 2400MB حجم واترمارک ---» ($ 23.99)'

EXTRA_VOLUME = '🔵 در صورت نیاز به حجم واترمارک بیشتر، می‌توانید علاوه بر گزینه‌های بالا،' \
               ' بسته‌های حجمی زیر را نیز خریداری کنید:'

VOLUME1 = '📦🎞 200MB ---» (1.99 $)'

VOLUME2 = '📦🎞 500MB ---» (3.99 $)'

VOLUME3 = '📦🎞 1500MB ---» (9.99 $)'

VOLUME4 = '📦🎞 5000MB ---» (24.99 $)'

PAYMENT_DESCRIPTION = '🔻 بسته به نیاز خود از بین پلن‌های موجود یکی را انتخاب کنید ' \
                      'و از طریق یکی از روش‌های پرداخت، نسبت به پرداخت مبلغ آن اقدام کنید.'

PRO_ACTIVATED = '🔥🎁 اشتراک پرمیوم ۳ روزه به همراه 20MB حجم واترمارک به رایگان برای شما فعال شد:'

START = '📅 شروع:'

END = '📅 پایان:'

PRO_ACTIVATE_BEFORE = '⚠️ پیش از این، اشتراک پرمیوم رایگان برای شما فعال شده است!\n\n'

PAYMENT_METHODS = 'لطفا مبلغ اشتراک را به یکی از روش‌های زیر پرداخت کرده و سپس آیدی و مشخصات پرداخت خود را' \
                  ' به پشتیبان ارسال کنید، اشتراک شما حداکثر ظرف ۲۴ ساعت پس از پرداخت موفق، شارژ خواهد شدشد.\n' \
                  'آیدی شما: {}\n' \
                  'پشتیبان: @WMarkProBotSupport'

PAYMENT_HEADER = '🏦 روش‌های پرداخت:'

PAYPAL = '💳 پرداخت از طریق پی‌پال'

PAYPAL_DESCRIPTION = 'از طریق لینک زیر مبلغ اشتراک را پرداخت کنید.\n' \
                     'https://paypal.me/robomizbot'

CRYPTOCURRENCY = '💎 پرداخت از طریق ارزهای دیجیتال'

CRYPTOCURRENCY_DESCRIPTION = 'مبلغ دلاری پلن مورد نظر خود را در ضریب تبدیل ارز موردنظر ضرب کرده و حاصل را ' \
                             ' به آدرس کیف پول داده شده انتقال دهید.'

EXCHANGE_RATE = 'ضریب تبدیل: {}'

BITCOIN = 'بیت‌کوین'

ETHEREUM = 'اتریوم'

LITECOIN = 'لایت‌کوین'

TETHER = 'تتر'

WALLET_ADDRESS = 'آدرس: {}'

OTHER_CRYPTO = '🔻 برای پرداخت با دیگر ارزها با پشتیبان @WMarkProBotSupport تماس بگیرید.'
